In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(data,index=labels)

#### Q21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [3]:
df.pivot_table(index='animal', columns='visits', values='age' , aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN

#### Q22. You have a DataFrame df with a column 'A' of integers. For example:

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
How do you filter out rows which contain the same integer as the row immediately above?

In [4]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [5]:
filtered_df = df[df['A'] != df['A'].shift(1)]

In [6]:
filtered_df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### Q23. Given a DataFrame of numeric values, say

df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values

how do you subtract the row mean from each element in the row?

In [7]:
df.sub(df.mean(axis=1),axis=0)

      A
0   0.0
1   0.0
2   0.0
3   0.0
4   0.0
5   0.0
6   0.0
7   0.0
8   0.0
9   0.0
10  0.0

#### Q24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

Which column of numbers has the smallest sum? (Find that column's label.)

In [8]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.243705,0.519995,0.230371,0.719706,0.416252,0.698954,0.908904,0.048195,0.390988,0.863044
1,0.663314,0.378942,0.201690,0.640573,0.666474,0.832089,0.506365,0.270166,0.369703,0.427004
2,0.894764,0.627759,0.172402,0.008297,0.031672,0.517368,0.651707,0.492313,0.251604,0.276783
3,0.035861,0.598090,0.560270,0.189696,0.122308,0.976743,0.959149,0.160340,0.898204,0.376890
4,0.163849,0.141851,0.361916,0.485111,0.968183,0.401765,0.844482,0.802254,0.078637,0.536389

In [9]:
df.sum().idxmin()

'c'

#### Q25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [10]:
len(df.drop_duplicates(keep=False))

5

#### Q26. You have a DataFrame that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, find the column which contains the third NaN value.

(You should return a Series of column labels.)

In [11]:
(df.isnull().cumsum(axis=1)==3).idxmin(axis=1)

0    a
1    a
2    a
3    a
4    a
dtype: object

#### Q27. A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example:

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

For each group, find the sum of the three greatest values.

In [12]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),

'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

In [13]:
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

C:\Users\sachu\AppData\Local\Temp\ipykernel_12240\1593056217.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

#### Q28. A DataFrame has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). For each group of 10 consecutive integers in 'A' (i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.

In [14]:
data = {'A': [5, 15, 25, 35, 45, 55, 65, 75, 85, 95],
        'B': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]}

In [15]:
fd=pd.DataFrame(data)

In [18]:
fd.groupby(pd.cut(fd['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]       10
(10, 20]      20
(20, 30]      30
(30, 40]      40
(40, 50]      50
(50, 60]      60
(60, 70]      70
(70, 80]      80
(80, 90]      90
(90, 100]    100
Name: B, dtype: int64

#### Q29. Consider a DataFrame df where there is an integer column 'X':

df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.

In [19]:
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [21]:
x = (df['X'] != 0).cumsum()
y = x != x.shift()
df['Y'] = y.groupby((y != y.shift()).cumsum()).cumsum()

In [22]:
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

#### Q30. Consider a DataFrame containing rows and columns of purely numerical data. Create a list of the row-column index locations of the 3 largest values.

In [23]:
df.unstack().sort_values()[-3:].index.tolist()

[('X', 4), ('X', 6), ('X', 0)]